######################################
# title: 同构造沉积
# date: 2019-01-19
# authors: 李长圣
# E-mail: sheng0619@163.com
# more info, see www.geovbox.com
#######################################
#从 0000046000.sav <版本1.3> 计算节点恢复，由 一个实例学会ZDEM 生成
RES 0000046000.sav
# 每次 100 步更新一次进度条
SET stepbar 100
#设置墙的挤压速度 x方向速度为2.0
WALL id 1 xv 2.0
#设置墙的挤压量x方向推进1000.0，每挤压1000.0保存一次计算结果
IMPLE wall id 1 xmove 1000.0 save 1000.0 print 1000.0 ps 1000.0

##################################### 剥蚀 #####################################
#删除4000米以上的颗粒
DEL RANGE y 4000.0 999000.0
################################################################################

#设置墙的挤压速度 x方向速度为2.0
WALL id 1 xv 2.0
#设置墙的挤压量x方向推进5000.0，每挤压2000.0保存一次计算结果
IMPLE wall id 1 xmove 5000.0 save 2000.0 print 1000.0 ps 1000.0

#计算停止
STOP

